ch04/4.2/SOAP_Doc/remove_request.xml

<?xml version="1.0" encoding="utf-8"?>
<soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
  <soap12:Body>
    <remove xmlns="http://tempuri.org/">
      <_ID>string</_ID>
    </remove>
  </soap12:Body>
</soap12:Envelope>